// LOW_PRIO: add types
export const STATUS_MAPPER: any = {
  PAYMENT: {
    statusColor: 'text-orange-600',
    statusText: 'Очікування на оплату',
  },
  HANDLING: {
    statusColor: 'text-amber-500',
    statusText: 'Очікування на відправку',
  },
  SHIPPING: {
    statusColor: 'text-blue-500',
    statusText: 'Товар в дорозі',
  },
  FINISHED: {
    statusColor: 'text-main',
    statusText: 'Завершено',
  },
  CANCELED: {
    statusColor: 'text-red-500',
    statusText: 'Скасовано',
  },
};

export const ORDER_DETAILS_MAPPER: any = {
  PAYMENT: {
    buy: 'Оплатіть товар та доставку в додатку Нової Пошти, якщо продавець не відправить товар протягом 2 днів, кошти буде повернено в повному розмірі.',
  },
  HANDLING: {
    sell: 'Покупець оплатив товар. Відправте його по номеру накладної протягом 2 днів, в іншому разі замовлення буде скасовано.\n\nВи отримаєте кошти після того як покупець забере товар, якщо він відмовиться від нього або не прийде на пошту, товар автоматично повернеться до вас і вам не доведеться платити за доставку.',
  },
  SHIPPING: {
    buy: 'Продавець відправив товар, очікуйте на повідомлення від Нової Пошти. Ви можете відмовитись від товару і кошти за нього буде повернено. Оплата послуг доставки не повертається.',
  },
};
